const { formatPhones } = require('./task01');

describe('formatPhones', () => {
  test('1', () => { //форматирует номера согласно примеру
    const input = [
      '590.423.4568',
      '650.124.7234',
      '650.507.9879',
      '011.44.1344.478968',
      '011.44.1644.429267',
      '11.44.1343.52',
    ];

    const expected = [
      '590.423.4****',
      '650.124.7****',
      '650.507.9****',
      '011.44.1344.4****',
      '011.44.1644.4****',
      '11.44.1343.5****',
    ];

    expect(formatPhones(input)).toEqual(expected);
  });
});
